; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v8)
             (pred_1 ?v5 ?v2)
             (pred_9 ?v9 ?v2)
             (pred_2 ?v4 ?v9 )
	     (pred_5 ?v9)
             (pred_12 ?v6)
             (pred_7 ?v5)
             (pred_4 ?v2)
             (pred_6 ?v9)
             (pred_8 ?v5)
             (pred_10 ?v9)
             (pred_3 ))



(:action op_2
:parameters (?v3 ?v7 ?v1 ?v12)
:precondition (and (pred_12 ?v3) (pred_12 ?v7) (pred_7 ?v1) (pred_4 ?v12)
          (pred_11 ?v3 ?v7) (pred_1 ?v1 ?v12)
                   (pred_9 ?v7 ?v12) (pred_5 ?v3) 
                   (pred_6 ?v7) (pred_8 ?v1))
:effect (and  (pred_10 ?v7) (not (pred_6 ?v7))))


(:action op_4
:parameters (?v3 ?v13)
:precondition (and (pred_12 ?v3) (pred_12 ?v13)
               (pred_5 ?v3) (pred_11 ?v3 ?v13) (pred_10 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v3))))

(:action op_3
:parameters (?v3 ?v1)
:precondition (and (pred_12 ?v3) (pred_7 ?v1) 
                  (pred_5 ?v3) (pred_2 ?v1 ?v3) (pred_3 ))
:effect (and (pred_8 ?v1)
   (not (pred_2 ?v1 ?v3)) (not (pred_3 ))))


(:action op_1
:parameters (?v3 ?v10 ?v11)
:precondition (and (pred_12 ?v3) (pred_7 ?v10) (pred_7 ?v11)
                  (pred_5 ?v3) (pred_8 ?v11) (pred_2 ?v10 ?v3))
:effect (and (pred_8 ?v10) (pred_2 ?v11 ?v3)
        (not (pred_8 ?v11)) (not (pred_2 ?v10 ?v3))))

(:action op_5
:parameters (?v3 ?v1)
:precondition (and (pred_12 ?v3) (pred_7 ?v1) 
                  (pred_5 ?v3) (pred_8 ?v1))
:effect (and (pred_3 ) (pred_2 ?v1 ?v3) (not (pred_8 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_05 obj_30 obj_07 obj_10 obj_25 obj_14 obj_12 obj_11 obj_23 obj_19 obj_24 obj_09 obj_02 obj_16 obj_17 obj_04 obj_15 obj_08 obj_06 obj_28 obj_27 obj_03 obj_29 obj_26
    obj_18 obj_21
    obj_22 obj_01 obj_20
    )

    (:init
       (pred_3)

       (pred_12 obj_13)
       (pred_12 obj_05)
       (pred_12 obj_30)
       (pred_12 obj_07)
       (pred_12 obj_10)
       (pred_12 obj_25)
       (pred_12 obj_14)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_23)
       (pred_12 obj_19)
       (pred_12 obj_24)
       (pred_12 obj_09)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_04)
       (pred_12 obj_15)
       (pred_12 obj_08)
       (pred_12 obj_06)
       (pred_12 obj_28)
       (pred_12 obj_27)
       (pred_12 obj_03)
       (pred_12 obj_29)
       (pred_12 obj_26)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_7 obj_22)
       (pred_7 obj_01)
       (pred_7 obj_20)

       (pred_11 obj_13 obj_25)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_30)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_30 obj_12)
       (pred_11 obj_30 obj_07)
       (pred_11 obj_30 obj_05)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_30)
       (pred_11 obj_10 obj_23)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_25 obj_14)
       (pred_11 obj_25 obj_13)
       (pred_11 obj_14 obj_24)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_14 obj_25)
       (pred_11 obj_12 obj_09)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_11 obj_02)
       (pred_11 obj_11 obj_23)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_23 obj_16)
       (pred_11 obj_23 obj_10)
       (pred_11 obj_23 obj_11)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_19 obj_24)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_24 obj_04)
       (pred_11 obj_24 obj_09)
       (pred_11 obj_24 obj_14)
       (pred_11 obj_24 obj_19)
       (pred_11 obj_09 obj_15)
       (pred_11 obj_09 obj_02)
       (pred_11 obj_09 obj_12)
       (pred_11 obj_09 obj_24)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_02 obj_16)
       (pred_11 obj_02 obj_11)
       (pred_11 obj_02 obj_09)
       (pred_11 obj_16 obj_06)
       (pred_11 obj_16 obj_23)
       (pred_11 obj_16 obj_02)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_04 obj_27)
       (pred_11 obj_04 obj_15)
       (pred_11 obj_04 obj_24)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_15 obj_03)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_09)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_08 obj_29)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_06 obj_26)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_28 obj_27)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_27 obj_03)
       (pred_11 obj_27 obj_04)
       (pred_11 obj_27 obj_28)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_03 obj_15)
       (pred_11 obj_03 obj_27)
       (pred_11 obj_29 obj_26)
       (pred_11 obj_29 obj_08)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_26 obj_06)
       (pred_11 obj_26 obj_29)
       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_29)
       (pred_9  obj_06 obj_18)
       (pred_9  obj_16 obj_21)
       (pred_9  obj_29 obj_21)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_30)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_25)
       (pred_10 obj_14)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_23)
       (pred_10 obj_19)
       (pred_10 obj_24)
       (pred_10 obj_09)
       (pred_10 obj_02)
       (pred_10 obj_17)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_28)
       (pred_10 obj_27)
       (pred_10 obj_03)
       (pred_10 obj_26)

       (pred_1  obj_22 obj_18)
       (pred_1  obj_01 obj_21)
       (pred_1  obj_20 obj_21)
       (pred_2 obj_22 obj_02)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_20 obj_02)
       (pred_5 obj_13)
    )

    (:goal (and
       (pred_2 obj_22 obj_05)
       (pred_2 obj_01 obj_28)
    ))
(:constraints
  (always (not (pred_5 obj_24)))
)
)

; plan
1. (op_4 obj_13 obj_25)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_25)
   goals met: 0 of 2
2. (op_4 obj_25 obj_19)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_19)
   goals met: 0 of 2
3. (op_4 obj_19 obj_17)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_17)
   goals met: 0 of 2
4. (op_4 obj_17 obj_04)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_04)
   goals met: 0 of 2
5. (op_4 obj_04 obj_15)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_15)
   goals met: 0 of 2
6. (op_4 obj_15 obj_09)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_09)
   goals met: 0 of 2
7. (op_4 obj_09 obj_02)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_02)
   goals met: 0 of 2
8. (op_3 obj_02 obj_22)
   deleted: (pred_2 obj_22 obj_02) (pred_3)
   added: (pred_8 obj_22)
   goals met: 0 of 2
9. (op_4 obj_02 obj_09)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_09)
   goals met: 0 of 2
10. (op_1 obj_09 obj_01 obj_22)
   deleted: (pred_8 obj_22) (pred_2 obj_01 obj_09)
   added: (pred_8 obj_01) (pred_2 obj_22 obj_09)
   goals met: 0 of 2
11. (op_4 obj_09 obj_15)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_15)
   goals met: 0 of 2
12. (op_4 obj_15 obj_04)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_04)
   goals met: 0 of 2
13. (op_4 obj_04 obj_27)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_27)
   goals met: 0 of 2
14. (op_4 obj_27 obj_28)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_28)
   goals met: 0 of 2
15. (op_5 obj_28 obj_01)
   deleted: (pred_8 obj_01)
   added: (pred_3) (pred_2 obj_01 obj_28)
   goals met: 1 of 2
16. (op_4 obj_28 obj_27)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_27)
   goals met: 1 of 2
17. (op_4 obj_27 obj_04)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_04)
   goals met: 1 of 2
18. (op_4 obj_04 obj_15)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_15)
   goals met: 1 of 2
19. (op_4 obj_15 obj_09)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_09)
   goals met: 1 of 2
20. (op_3 obj_09 obj_22)
   deleted: (pred_2 obj_22 obj_09) (pred_3)
   added: (pred_8 obj_22)
   goals met: 1 of 2
21. (op_4 obj_09 obj_12)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_12)
   goals met: 1 of 2
22. (op_4 obj_12 obj_30)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_30)
   goals met: 1 of 2
23. (op_4 obj_30 obj_05)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_05)
   goals met: 1 of 2
24. (op_5 obj_05 obj_22)
   deleted: (pred_8 obj_22)
   added: (pred_3) (pred_2 obj_22 obj_05)
   goals met: 2 of 2
